# Написать функцию Фиббоначи fib(n), которая вычисляет
# элементы последовательности Фиббоначи:
# 1 1 2 3 5 8 13 21 34 55 .......


def fib(n):
    f1 = 0
    f2 = 1
    for __ in range(n):
        f1, f2 = f2, f1 + f2
    return f1

print(fib(5432))
